""" add universal strings here. """

FIELD_REQUIRED = "پر کردن این فیلد الزامی است."
REPEATED_USER = "کاربری با این مشخصات وجود دارد."
NOT_REGISTERED = "کاربری با این مشخصات وجود ندارد."
WRONG_PASSWORD = "رمز عبور وارد شده غلط است."

INVALID_USERNAME = "نام کاربری وارد شده معتبر نیست. لطفا فقط از حروف انگلیسی، اعداد و علامت ـ استفاده کنید."
INVALID_EMAIL = " لطفا یک ایمیل معتبر وارد کنید."
INVALID_PERSIAN_NAME = " لطفا فقط از حروف فارسی و فاصله استفاده کنید."
INVALID_ENGLISH_NAME = " لطفا فقط از حروف انگلیسی و فاصله استفاده کنید."
INVALID_AMOUNT = "مبلغ وارد شده معتبر نیست."
INVALID_PHONE = "شماره تلفن وارد شده معتبر نیست"
INVALID_ACCOUNT = "شماره حساب وارد شده معتبر نیست"

NOT_ENOUGH_RIAL = "موجودی کیف پول ریالی کافی نیست."
NOT_ENOUGH_DOLLAR = "موجودی کیف پول دلار کافی نیست."
NOT_ENOUGH_EURO = "موجودی کیف پول یورو کافی نیست."

CUSTOMER_ACCESS_REMOVAL = """
با سلام. مشتری گرامی، دسترسی شما به دلیل زیر از سامانهٔ سپاا قطع شده است:

"""
EMPLOYEE_ACCESS_REMOVAL = """
با سلام. همکار گرامی، دسترسی شما به دلیل زیر از سامانهٔ سپاا قطع شده است:

"""
TRANSACTION_ACCEPTED = """
تراکنش شما به شماره تراکنش {} قبول و انجام شد. سپاا
"""

TRANSACTION_FAILED = """
تراکنش شما به شماره تراکنش {} به دلیل گذشت بیش از ۲۴ ساعت نامعتبر شد.
"""

SALARY_PAID = """
همکار گرامی، حقوق شما به میزان {} پرداخت شد.
"""
